openfoam2206/tutorials/verificationAndValidation/atmosphericModels/atmForestStability/setups.orig/common/0.orig/leafAreaDensity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      leafAreaDensity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField  uniform  0.14;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           $internalField;
    }

    top
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(inlet|outlet|left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
